Dataframe: Tabular dataset -with different types of data- built on numpy + matplotlib 

`dataframe.values` returns a 2d np array containing a list of lists (a list of "rows")
* access with square brackets`[]`for columns (that returns a pandas series); double squared brackets `[[]]`returns dataframe
    * to select a col name without spaces dot notation can be used.
* advanced:
    * loc
    * iloc

### Differences with basic python/other libraries:
#### Loops
* `for val in df` iterates over columns
*  to iterate over rows `for i, row in df.iterrows()`

#### Boolean conditions to subset
* & instead of and
* | instead of or

In [1]:
# import library
import pandas as pd

# Basics

In [2]:
# import dataset from external file to dataframe
df = pd.read_csv('../datasets/clean/simpledf_applevalues.csv', index_col=0)
# display the head of the data
display(df.head()) #df.tail() will print the last rows

           Br       Pt        Sp        UK
1961  19962.0  70000.0  385500.0  339000.0
1962  22600.0  58000.0  274500.0  583000.0
1963  23241.0  92000.0  480700.0  545000.0
1964  21158.0  85000.0  321600.0  653000.0
1965  40386.0  96000.0  446800.0  529000.0

In [3]:
# Print information about df
print(df.info()) #number of rows, cols, dtype in each col, number of missing values...

<class 'pandas.core.frame.DataFrame'>
Int64Index: 59 entries, 1961 to 2019
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Br      59 non-null     float64
 1   Pt      59 non-null     float64
 2   Sp      59 non-null     float64
 3   UK      59 non-null     float64
dtypes: float64(4)
memory usage: 2.3 KB
None

In [4]:
display(df.index, type(df.index)) # the row index (can be accessed as a list)
display(df.columns, type(df.columns)) # the column index

Int64Index([1961, 1962, 1963, 1964, 1965, 1966, 1967, 1968, 1969, 1970, 1971,
            1972, 1973, 1974, 1975, 1976, 1977, 1978, 1979, 1980, 1981, 1982,
            1983, 1984, 1985, 1986, 1987, 1988, 1989, 1990, 1991, 1992, 1993,
            1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004,
            2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015,
            2016, 2017, 2018, 2019],
           dtype='int64')

pandas.core.indexes.numeric.Int64Index

Index(['Br', 'Pt', 'Sp', 'UK'], dtype='object')

pandas.core.indexes.base.Index

In [5]:
# Sort df by apple production in Brazil (value in column Br)
df_br = df.sort_values('Br') # by default values are sorted in ascendent order
df_br.head()

           Br        Pt         Sp        UK
1961  19962.0   70000.0   385500.0  339000.0
1964  21158.0   85000.0   321600.0  653000.0
1973  22265.0  142910.0  1015100.0  490041.0
1962  22600.0   58000.0   274500.0  583000.0
1963  23241.0   92000.0   480700.0  545000.0

In [6]:
# Filter for rows where apple production in Brazil (value in column Br) is greater than 20000
br_gt_20k = df[df['Br'] > 20000]
br_gt_20k.head()

           Br       Pt        Sp        UK
1962  22600.0  58000.0  274500.0  583000.0
1963  23241.0  92000.0  480700.0  545000.0
1964  21158.0  85000.0  321600.0  653000.0
1965  40386.0  96000.0  446800.0  529000.0
1966  23559.0  86533.0  412200.0  370000.0

In [7]:
df.sum(axis=0)

Br    32621224.0
Pt    11426402.0
Sp    43963622.0
UK    20461412.0
dtype: float64

In [8]:
# Add total col for the four countries
df['total'] = df.sum(axis=1) # axis 1: sum 'through the columns'; axis 0: through the rows
# if executing that several times the sum is performed several times
df.head()

           Br       Pt        Sp        UK      total
1961  19962.0  70000.0  385500.0  339000.0   814462.0
1962  22600.0  58000.0  274500.0  583000.0   938100.0
1963  23241.0  92000.0  480700.0  545000.0  1140941.0
1964  21158.0  85000.0  321600.0  653000.0  1080758.0
1965  40386.0  96000.0  446800.0  529000.0  1112186.0

In [9]:
# Add total col for the south of europe as sum 
df['seu']=df['Sp'] + df['Br'] # also df = df.assign(seu=df['Sp'] + df.Br)
df.head()

           Br       Pt        Sp        UK      total       seu
1961  19962.0  70000.0  385500.0  339000.0   814462.0  405462.0
1962  22600.0  58000.0  274500.0  583000.0   938100.0  297100.0
1963  23241.0  92000.0  480700.0  545000.0  1140941.0  503941.0
1964  21158.0  85000.0  321600.0  653000.0  1080758.0  342758.0
1965  40386.0  96000.0  446800.0  529000.0  1112186.0  487186.0

In [10]:
# Add prop_seu col as proportion of total
df['prop_seu'] = df['seu']/df['total']
df.head()

           Br       Pt        Sp        UK      total       seu  prop_seu
1961  19962.0  70000.0  385500.0  339000.0   814462.0  405462.0  0.497828
1962  22600.0  58000.0  274500.0  583000.0   938100.0  297100.0  0.316704
1963  23241.0  92000.0  480700.0  545000.0  1140941.0  503941.0  0.441689
1964  21158.0  85000.0  321600.0  653000.0  1080758.0  342758.0  0.317146
1965  40386.0  96000.0  446800.0  529000.0  1112186.0  487186.0  0.438044

### Sumary statistics

In [11]:
#another dataset
pop = pd.read_csv('../datasets/clean/pop.csv', index_col=0, header=0)
display(pop.head())
display(pop.shape) # (rows, columns)

          Area                        Element  Year          Unit     Value
0  Afghanistan  Total Population - Both sexes  1950  1000 persons  7752.118
1  Afghanistan        Total Population - Male  1950  1000 persons  4099.243
2  Afghanistan      Total Population - Female  1950  1000 persons  3652.874
3  Afghanistan               Rural population  1950  1000 persons  7286.991
4  Afghanistan               Urban population  1950  1000 persons   465.127

(70585, 5)

In [12]:
# Print the mean of the value for the rural population
print(pop[pop.Element == 'Rural population']['Value'].mean(), '\n')

# Print the median of the value for the rural population
print(pop[pop.Element == 'Rural population'].median(), '\n') #sumary statistics of all columns with numeric values

# Print the maximum of the year column
print(pop.Year.max(), '\n')

# Print the minimum of the year column
print(pop.Year.min(), '\n')

# Print the cumulative sum/ the cumulative max
print(pop[pop.Element == 'Rural population']['Value'].cumsum().head(), '\n', 
     pop[pop.Element == 'Rural population']['Value'].cummax().head(), '\n')

# Print the 10th percentile and the 1st quartile of the value column
print('10th percentile:', pop.Value.quantile(0.1),'\n1st quartile:', pop.Value.quantile(0.25))

16017.317497550159

Year     1986.000
Value    1344.157
dtype: float64

2018

1950

3      7286.991
8     14639.847
13    22065.210
18    29569.771
23    37160.141
Name: Value, dtype: float64
 3     7286.991
8     7352.856
13    7425.363
18    7504.561
23    7590.370
Name: Value, dtype: float64

10th percentile: 32.2184
1st quartile: 184.245

In [13]:
# Create custom function 
def iqr(column):
    return column.quantile(0.75) - column.quantile(0.25)

# With the first dataset, update to print IQR and median of temperature_c, fuel_price_usd_per_l, & unemployment
print(df[['Br', 'Pt', 'Sp', 'UK']].agg([iqr, 'median','mean']), '\n')
print(df[['Br', 'Pt', 'Sp', 'UK']].agg([iqr, 'median', sum, min, max]))

                   Br             Pt             Sp            UK
iqr     917592.000000  162755.000000  333941.500000  179750.00000
median  526904.000000  229794.000000  730000.000000  346600.00000
mean    552902.101695  193667.830508  745146.135593  346803.59322

                Br          Pt          Sp          UK
iqr       917592.0    162755.0    333941.5    179750.0
median    526904.0    229794.0    730000.0    346600.0
sum     32621224.0  11426402.0  43963622.0  20461412.0
min        19962.0     58000.0    274500.0    143900.0
max      1378617.0    355700.0   1161700.0    653000.0

In [14]:
# Import numpy and use its function to do the above calculations
import numpy as np
print(df[['Br', 'Pt', 'Sp', 'UK']].agg([iqr, np.median, np.mean]))

                   Br             Pt             Sp            UK
iqr     917592.000000  162755.000000  333941.500000  179750.00000
median  526904.000000  229794.000000  730000.000000  346600.00000
mean    552902.101695  193667.830508  745146.135593  346803.59322

### More subseting and calculations

In [15]:
# Subset for rows of rural and urban population
pop_ru = pop[pop['Element'].isin(['Rural population','Urban population'])] # isin takes a list of values
display(pop_ru.head())
display(pop_ru.shape)

           Area           Element  Year          Unit     Value
3   Afghanistan  Rural population  1950  1000 persons  7286.991
4   Afghanistan  Urban population  1950  1000 persons   465.127
8   Afghanistan  Rural population  1951  1000 persons  7352.856
9   Afghanistan  Urban population  1951  1000 persons   486.654
13  Afghanistan  Rural population  1952  1000 persons  7425.363

(29798, 5)

In [16]:
# Drop duplicate year/value combinations
pop_ru2 = pop.drop_duplicates(['Area','Element'])
display(pop_ru2.head())
#check conditions (number of rows)
display(pop_ru.shape[0] == pop_ru2.shape[0], pop.shape[0] == pop_ru2.shape[0])

# Subset the rows for Rural population and drop duplicate countries
ruralpop_per_country = pop[pop.Element =='Rural population'].drop_duplicates('Area',
                                                                             ignore_index=True)[['Area', 'Year', 'Value']]
display(ruralpop_per_country.sort_values('Year', ascending=False).head())

          Area                        Element  Year          Unit     Value
0  Afghanistan  Total Population - Both sexes  1950  1000 persons  7752.118
1  Afghanistan        Total Population - Male  1950  1000 persons  4099.243
2  Afghanistan      Total Population - Female  1950  1000 persons  3652.874
3  Afghanistan               Rural population  1950  1000 persons  7286.991
4  Afghanistan               Urban population  1950  1000 persons   465.127

False

False

                                 Area  Year      Value
203                       South Sudan  2012   8847.540
206                             Sudan  2012  23988.926
197        Sint Maarten  (Dutch part)  2011      0.000
26   Bonaire, Sint Eustatius and Saba  2011      5.557
57                           CuraÃ§ao  2011     15.398

In [17]:
# Count the number of measurements per element
pop_counts = pop.Element.value_counts()
print(pop_counts)

Total Population - Both sexes    14915
Rural population                 14899
Urban population                 14899
Total Population - Male          12936
Total Population - Female        12936
Name: Element, dtype: int64

In [18]:
# Get the proportion of measurements per element in the dataset
pop_props = pop.Element.value_counts()/len(pop.Element.index)
print(pop_props)

Total Population - Both sexes    0.211306
Rural population                 0.211079
Urban population                 0.211079
Total Population - Male          0.183268
Total Population - Female        0.183268
Name: Element, dtype: float64

In [19]:
# Get the proportion of measurements per element in the dataset and sort
pop_props_sorted = pop.Element.value_counts(sort=True, normalize=True) #same calculation as above
print(pop_props_sorted)

Total Population - Both sexes    0.211306
Rural population                 0.211079
Urban population                 0.211079
Total Population - Male          0.183268
Total Population - Female        0.183268
Name: Element, dtype: float64

In [20]:
# Calc total weekly sales
pop_all = pop.Value.sum() #used in a series instead of df, no need to specify axis
pop_all

1229978428.277

In [21]:
# Subset for Rural population, calc total population value
ruralpop = pop[pop.Element =='Rural population']["Value"].sum()

# Subset for Urban population, calc total population value
urbanpop = pop[pop.Element =='Urban population']["Value"].sum()

# Subset for female population, calc total population value
fempop = pop[pop.Element =='Total Population - Female']["Value"].sum()

# Subset for male population, calc total population value
malepop = pop[pop.Element =='Total Population - Male']["Value"].sum()

# Get proportion for each type
pop_propn_by_element = [ruralpop, urbanpop, fempop, malepop] / pop_all
print(pop_propn_by_element)

[0.1940213  0.13918546 0.16510831 0.16826564]

In [22]:
#same as before with less code: groupby()
pop_by_element = pop.groupby('Element')['Value'].sum()
pop_by_element

Element
Rural population                 2.386420e+08
Total Population - Both sexes    4.100985e+08
Total Population - Female        2.030797e+08
Total Population - Male          2.069631e+08
Urban population                 1.711951e+08
Name: Value, dtype: float64

In [23]:
# Get proportion for each type
pop_propn_by_element2 = pop_by_element / sum(pop.Value)
print(pop_propn_by_element2, '\n', pop_propn_by_element) # both calculations give the same results (different order)

Element
Rural population                 0.194021
Total Population - Both sexes    0.333419
Total Population - Female        0.165108
Total Population - Male          0.168266
Urban population                 0.139185
Name: Value, dtype: float64
 [0.1940213  0.13918546 0.16510831 0.16826564]

### Index

In [24]:
# subset by setting a range
display(df.loc['1975':'1979'])
display(df.loc['1975':'1979', 'Pt':'Sp'])

           Br        Pt         Sp        UK      total        seu  prop_seu
1975  34192.0  140503.0  1078700.0  374600.0  1627995.0  1112892.0  0.683597
1976  42348.0  154553.0  1007300.0  363500.0  1567701.0  1049648.0  0.669546
1977  46125.0   94471.0   730000.0  270000.0  1140596.0   776125.0  0.680456
1978  51758.0  117382.0  1072000.0  391200.0  1632340.0  1123758.0  0.688434
1979  69099.0  107385.0  1161700.0  363000.0  1701184.0  1230799.0  0.723496

            Pt         Sp
1975  140503.0  1078700.0
1976  154553.0  1007300.0
1977   94471.0   730000.0
1978  117382.0  1072000.0
1979  107385.0  1161700.0